import ast
import asyncio
import json
import random

import requests

# # que = '模拟将裂解炉炉膛温度调整至450°，结焦速率和乙烯收率会如何变？'
# que = '乙烯收率与炉膛温度的关系'
# o_data = [{"tag": "XC1137Y", "description": "A炉膛温度", "value": 837.9442661}, {"tag": "XC1237Y", "description": "B炉膛温度", "value": 837.8584862}, {"tag": "average_furnace_temp", "description": "所有炉管COT平均温度", "value": 838.3639744}, {"tag": "XX1106Y", "description": "裂解炉A炉膛进料量", "value": 22.03210663}, {"tag": "XX1306Y", "description": "裂解炉B炉膛进料量", "value": 21.81718045}, {"tag": "TSBV", "description": "烃水比", "value": 0.149994}]
# data = [{"tag": "XC1137Y", "description": "A炉膛温度", "value": 837.9442661}, {"tag": "XC1237Y", "description": "B炉膛温度", "value": 837.8584862}, {"tag": "average_furnace_temp", "description": "所有炉管COT平均温度", "value": 838.78}, {"tag": "XX1106Y", "description": "裂解炉A炉膛进料量", "value": 27.03210663}, {"tag": "XX1306Y", "description": "裂解炉B炉膛进料量", "value": 29.81718045}, {"tag": "TSBV", "description": "烃水比", "value": 0.249994},  {"tag": "XT1015Y", "description": "燃料气进口管线温度、报警", "value": 48.10516795}]
# prompt_str = f"""
#         你是一个数据生成大师，根据给定的数据进行适当修改，最后生成固定格式的数据返回。
#
# 用户问题如下所示: [模拟将裂解炉炉膛温度调整至850°，结焦速率和乙烯收率会如何变？]
#
# 输入数据如下所示
# data = {o_data}
#
# 根据用户问题，保持其他数据不变，解析其中需要改变的数据，如裂解炉炉膛温度改为850，生成新的数据如下所示：
# [[ 850,  850,  838.3639744, 22.03210663, 21.81718045,  0.149994 ]]
#
# 如果用户问题为：[乙烯收率与炉膛温度的关系] 类似这些没用明确定量的问题，需要把涉及到的特征值进行减小10%、减小5%、增加5%、增加10%的操作，并生成4*涉及特征的数据。如下所示：（要把所有值计算出来）
# [[ 837.9442661乘以0.9,  837.8584862,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661乘以0.95,  837.8584862,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661乘以1.05,  837.8584862,  838.3639744, 22.03210663, 21.81718045,  0.149994],
# [ 837.9442661乘以1.1,  837.8584862,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661,  837.8584862乘以0.9,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661,  837.8584862乘以0.95,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661,  837.8584862乘以1.05,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# [ 837.9442661,  837.8584862乘以1.1,  838.3639744, 22.03210663, 21.81718045,  0.149994 ],
# ]
# 最终只返回计算后的值数据
#
#
# 输入问题为：{que}
# 输入数据为: {data}
# ##限制
# - 最终生成的每个列表内的数据个数必须与用户输入数据的对象个数一致
# - 用户如果明确了定量问题，涉及到的特征值都需要改变，输出结果列表内只能有一个结果
# - 未涉及到的特征值不要有任何改变
# - 只返回列表格式，不需要任何字符串文字。
# /no_think
# """


# que = '模拟将裂解炉炉膛温度调整至456°，结焦速率和乙烯收率会如何变？'
que = '乙烯收率与裂解炉炉膛温度的关系'
o_d = [{'tag': 'XC1137Y', 'description': 'A炉膛温度'}, {'tag': 'XC1237Y', 'description': 'B炉膛温度'}, {'tag': 'average_furnace_temp', 'description': '所有炉管COT平均温度'}, {'tag': 'XX1106Y', 'description': '裂解炉A炉膛进料量'}, {'tag': 'XX1306Y', 'description': '裂解炉B炉膛进料量'}, {'tag': 'TSBV', 'description': '烃水比'}, {'tag': 'CokeRate', 'description': '结焦速率'}, {'tag': 'yield', 'description': '裂解炉乙烯收率'}]
# r_d1 = [[842.0, 841.875, 842.4707961309523, 27.435416816666663, 27.219075616666668, 0.179993, 0.1253627450168185, 49.94744333094091], [456, 841.875, 842.4707961309523, 27.435416816666663, 27.219075616666668, 0.179993, 0.2653083442, 49.590727894000004],[456, 841.875, 8.470796133523, 27.435416816666663, 27.219075616666668, 0.179993, 0.2653083442, 49.590727894000004],[456, 841.875, 8.470796133523, 27.435416816666663, 27.219075616666668, 0.179993, 0.2653083442, 49.590727894000004]]
r_d1 = [[842.5667782738095, 842.125, 842.0104166666666, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.5485279737717741, 50.14281548412966], [757.9125, 842.0104166666666, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4162314702463316, 29.11999999482596], [799.964375, 842.0104166666666, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4182771967983902, 38.66442812517044], [884.33125, 842.0104166666666, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.42238145032577057, 57.813005329379656], [927.383125, 842.0104166666666, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4244758245671904, 67.58440141609574], [842.125, 757.809375, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4183137796800892, 27.409087204092696], [842.125, 799.860375, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.41931981199202945, 37.80906570803769], [842.125, 884.2114375, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4213378352119646, 58.67062041030215], [842.125, 927.262375, 842.5667782738095, 27.6656252, 27.419205883333333, 0.179993, 39.44804706666667, 0.4223677901282406, 69.31790167768415]]

prompt_str = f"""
# 角色
你是一位专业的仿真结果分析大师，擅长对用户输入的特定格式数据进行深入分析，根据控制变量法分别精准分析出每一个变动特征对目标的影响，并以清晰易懂的语言呈现分析结果。

## 技能
### 技能 1: 分析仿真数据变化规律
1. 当前用户输入问题：
{que}
2. 当用户输入类似以下格式的两份数据：
{o_d}
上述为第一份数据为所有数据的信息，列表中每一个字典都是一个特征数据的位号、描述；
{r_d1}
第二份数据为所有特征的数值，其中，第一个列表表示的是所有特征的初始数值，其他列表数据为通过控制变量法得到的数据。

3. 根据用户问题，仔细核对用户提到的关键特征，并观察数据的差异，给出一段总结描述
4. 请依据提供的数据生成仿真对比结果表。要求将初始数值置于首行作为基准，并在后续数据行中，将所有相对于初始值发生变动的数值加粗，以突显差异。
## 限制:
- 仅依据用户输入的数据进行分析和回答，不涉及其他无关内容。
- 回答必须按照规定的格式组织语言，清晰准确地呈现分析结果。
- 不要出现原始问题
- 表格放在总结性的语句下边
# /no_think
"""


llm_params = {
            "model": "qwen3",
            "messages": [{
                "role": "user",
                "content": prompt_str
            }]
        }
response = requests.post(
    url= "http://nlb-2weu6cb4a97uoz9cqu39kvmj.nlb.cn-beijing.volces.com:32004/v1/chat/completions",
    data=json.dumps(llm_params, ensure_ascii=False),
    headers={
        'Content-Type': 'application/json',
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/117.0.0.0 Safari/537.36'
})
if response.status_code == 200:
    llm_resp = response.json().get("choices")[0].get("message").get("content")
else:
    success = -1
    llm_resp = response.text

print(type(llm_resp))
print(llm_resp)


# 4. 请根据这两份数据生成一个“仿真对比结果展示”的表格,并把每一个列表相比初始值有变化的数据加粗。